import React, { Component } from 'react'
import {BrowserRouter as Router,Link} from "react-router-dom"
import {NavBar,Icon, Toast,Button} from 'antd-mobile';
import "../../css/ChengYu/jielong.css"

export default class Idiomjielong extends Component {
	constructor() {
		super();
		this.content =[
			{
				question: [
					["#", "#", "#", "#", "百", "#"],
					["#", "走", "", "观", "", "#"],
					["#", "#", "", "#", "", "#"],
					["#", "#", "", "#", "", "#"],
					["#", "#", "功", "#", "#", "#"],
					["#", "#", "#", "#", "#", "#"]
				],
				choose: ["放", "马", "齐", "乘", "花", "到", "一", "成"],
				answer: [
					["#", "#", "#", "#", "百", "#"],
					["#", "走", "马", "观", "花", "#"],
					["#", "#", "到", "#", "齐", "#"],
					["#", "#", "成", "#", "放", "#"],
					["#", "#", "功", "#", "#", "#"],
					["#", "#", "#", "#", "#", "#"]
				]
			}, {
			question: [
				["#", "#", "#", "#", "#", "#"],
				["#", "#", "#", "", "#", "#"],
				["#", "#", "#", "暖", "#", "#"],
				["火", "", "银", "", "#", "#"],
				["#", "", "相", "", "放", "#"],
				["#", "#", "#", "#", "#", "#"]
			],
			choose: ["春", "马", "竞", "树", "花", "到", "色", "开"],
			answer: [
				["#", "#", "#", "#", "#", "#"],
				["#", "#", "#", "春", "#", "#"],
				["#", "#", "#", "暖", "#", "#"],
				["火", "树", "银", "花", "#", "#"],
				["#", "竞", "相", "开", "放", "#"],
				["#", "#", "#", "#", "#", "#"]
			]
		},
		{
			question: [
				["#", "#", "#", "", "#", "#"],
				["#", "人 ", "#", "龙", "#", "#"],
				["#", "", "往", "", "", "#"],
				["#", "己", "#", "首", "", ""],
				["#", "百", "#", "#", "#", "#"],
				["#", "#", "#", "#", "#", "#"]
			],
			choose: ["无", "群", "放", "前", "花", "到", "一", "勇"],
			answer: [
				["#", "#", "#", "群", "#", "#"],
				["#", "人 ", "#", "龙", "#", "#"],
				["#", "一", "往", "无", "前", "#"],
				["#", "己", "#", "首", "", ""],
				["#", "百", "#", "#", "#", "#"],
				["#", "#", "#", "#", "#", "#"]
			],
		}, {
			question: [
				["#", "#", "#", "#", "#", "#"],
				["学", "", "", "车", "#", "#"],
				["#", "#", "#", "", "#", "#"],
				["#", "#", "", "", "识", "途"],
				["#", "#", "#", "龙", "#", "#"],
				["#", "#", "#", "#", "#", "#"]
			],
			choose: ["富", "马", "齐", "水", "花", "车", "五", "老"],
			answer: [
				["#", "#", "#", "#", "#", "#"],
				["学", "富", "五", "车", "#", "#"],
				["#", "#", "#", "水", "#", "#"],
				["#", "#", "老", "马", "识", "途"],
				["#", "#", "#", "龙", "#", "#"],
				["#", "#", "#", "#", "#", "#"]
			],
		},
		{
			question: [
				["#", "#", "#", "", "#", "#"],
				["#", "#", "#", "不", "#", "#"],
				["#", "", "不", "", "收", "#"],
				["#", "轮", "", "#", "", "#"],
				["#", "美", "#", "数", "#", "#"],
				["#", "", "#", "#", "#", "#"]
			],
			choose: ["数", "马", "美", "换", "焕", "到", "盛", "胜"],
			answer: [
				["#", "#", "#", "数", "#", "#"],
				["#", "#", "#", "不", "#", "#"],
				["#", "美", "不", "胜", "收", "#"],
				["#", "轮", "", "#", "", "#"],
				["#", "美", "#", "数", "#", "#"],
				["#", "焕", "#", "#", "#", "#"]
			],
		}, {
			question: [
				["#", "#", "#", "#", "#", "#"],
				["#", "巧", "", "天", "工", "#"],
				["#", "#", "#", "长", "#", "#"],
				["#", "", "崩", "", "裂", "#"],
				["#", "#", "#", "", "#", "#"],
				["#", "#", "#", "#", "#", "#"]
			],
			choose: ["夺", "巧", "齐", "久", "花", "开", "山", "地"],
			answer: [
				["#", "#", "#", "#", "#", "#"],
				["#", "巧", "夺", "天", "工", "#"],
				["#", "#", "#", "长", "#", "#"],
				["#", "山", "崩", "地", "裂", "#"],
				["#", "#", "#", "久", "#", "#"],
				["#", "#", "#", "#", "#", "#"]
			],
		},
		{
			question: [
				["#", "#", "#", "#", "#", "#"],
				["#", "兴", "", "作", "浪", "#"],
				["#", "#", "吹", "#", "#", "#"],
				["#", "#", "", "长", "", ""],
				["#", "#", "动", "#", "#", "#"],
				["#", "#", "#", "#", "#", "#"]
			],
			choose: ["放", "风", "惊", "草", "飞", "到", "莺", "涛"],
			answer: [
				["#", "#", "#", "#", "#", "#"],
				["#", "兴", "风", "作", "浪", "#"],
				["#", "#", "吹", "#", "#", "#"],
				["#", "#", "草", "长", "莺", "飞"],
				["#", "#", "动", "#", "#", "#"],
				["#", "#", "#", "#", "#", "#"]
			],
		}, {
			question: [
				["#", "#", "#", "#", "#", "#"],
				["#", "与", "", "俱", "", "#"],
				["#", "#", "积", "#", "#", "#"],
				["#", "明", "", "清", "", "#"],
				["#", "#", "累", "#", "#", "#"],
				["#", "#", "#", "#", "#", "#"]
			],
			choose: ["日", "星", "惜", "增", "花", "到", "月", "风"],
			answer: [
				["#", "#", "#", "#", "#", "#"],
				["#", "与", "日", "俱", "增", "#"],
				["#", "#", "积", "#", "#", "#"],
				["#", "明", "月", "清", "风", "#"],
				["#", "#", "累", "#", "#", "#"],
				["#", "#", "#", "#", "#", "#"]
			],
		},
		{
			question: [
				["#", "#", "#", "#", "劫", "#"],
				["#", "#", "", "#", "", "#"],
				["#", "", "舟", "", "济", "#"],
				["#", "#", "", "#", "", "#"],
				["#", "#", "剑", "#", "#", "#"],
				["#", "#", "#", "#", "#", "#"]
			],
			choose: ["刻", "穷", "富", "共", "同", "到", "济", "求"],
			answer: [
				["#", "#", "#", "#", "劫", "#"],
				["#", "#", "刻", "#", "富", "#"],
				["#", "同", "舟", "共", "济", "#"],
				["#", "#", "求", "#", "贫", "#"],
				["#", "#", "剑", "#", "#", "#"],
				["#", "#", "#", "#", "#", "#"]
			],
		}, {
			question: [
				["#", "#", "#", "#", "#", "#"],
				["#", "#", "", "滴", "", "穿"],
				["#", "#", "#", "", "#", "#"],
				["#", "#", "#", "成", "#", "#"],
				["#", "", "洁", "", "清", "#"],
				["#", "#", "#", "#", "#", "#"]
			],
			choose: ["水", "壶", "玉", "冰", "花", "晶", "石", "成"],
			answer: [
				["#", "#", "#", "#", "#", "#"],
				["#", "#", "水", "滴", "石", "穿"],
				["#", "#", "#", "水", "#", "#"],
				["#", "#", "#", "成", "#", "#"],
				["#", "玉", "洁", "冰", "清", "#"],
				["#", "#", "#", "#", "#", "#"]
			],
		}
		]
		this.state = {
			num: 1,
			scsubmitFront: 'jlsubmit-front',
			front: '上一题',
			next:"下一题",
			content: [
				{
					question: [
						["#", "#", "#", "#", "百", "#"],
						["#", "走", "", "观", "", "#"],
						["#", "#", "", "#", "", "#"],
						["#", "#", "", "#", "", "#"],
						["#", "#", "功", "#", "#", "#"],
						["#", "#", "#", "#", "#", "#"]
					],
					choose: ["放", "马", "齐", "乘", "花", "到", "竟", "成"],
					answer: [
						["#", "#", "#", "#", "百", "#"],
						["#", "走", "马", "观", "花", "#"],
						["#", "#", "到", "#", "齐", "#"],
						["#", "#", "成", "#", "放", "#"],
						["#", "#", "功", "#", "#", "#"],
						["#", "#", "#", "#", "#", "#"]
					]
				}, {
					question: [
						["#", "#", "#", "#", "#", "#"],
						["#", "#", "#", "", "#", "#"],
						["#", "#", "#", "暖", "#", "#"],
						["火", "", "银", "", "#", "#"],
						["#", "", "相", "", "放", "#"],
						["#", "#", "#", "#", "#", "#"]
					],
					choose: ["春", "马", "竞", "树", "花", "到", "色", "开"],
					answer: [
						["#", "#", "#", "#", "#", "#"],
						["#", "#", "#", "春", "#", "#"],
						["#", "#", "#", "暖", "#", "#"],
						["火", "树", "银", "花", "#", "#"],
						["#", "竞", "相", "开", "放", "#"],
						["#", "#", "#", "#", "#", "#"]
					]
				},
				{
					question: [
						["#", "#", "#", "", "#", "#"],
						["#", "人 ", "#", "龙", "#", "#"],
						["#", "", "往", "", "", "#"],
						["#", "己", "#", "首", "#", "#"],
						["#", "百", "#", "#", "#", "#"],
						["#", "#", "#", "#", "#", "#"]
					],
					choose: ["无", "群", "放", "前", "花", "到", "一", "勇"],
					answer: [
						["#", "#", "#", "群", "#", "#"],
						["#", "人 ", "#", "龙", "#", "#"],
						["#", "一", "往", "无", "前", "#"],
						["#", "己", "#", "首", "#", "#"],
						["#", "百", "#", "#", "#", "#"],
						["#", "#", "#", "#", "#", "#"]
					],
				}, {
					question: [
						["#", "#", "#", "#", "#", "#"],
						["学", "", "", "车", "#", "#"],
						["#", "#", "#", "", "#", "#"],
						["#", "#", "", "", "识", "途"],
						["#", "#", "#", "龙", "#", "#"],
						["#", "#", "#", "#", "#", "#"]
					],
					choose: ["富", "马", "齐", "水", "花", "车", "五", "老"],
					answer: [
						["#", "#", "#", "#", "#", "#"],
						["学", "富", "五", "车", "#", "#"],
						["#", "#", "#", "水", "#", "#"],
						["#", "#", "老", "马", "识", "途"],
						["#", "#", "#", "龙", "#", "#"],
						["#", "#", "#", "#", "#", "#"]
					],
				},
				{
					question: [
						["#", "#", "#", "", "#", "#"],
						["#", "#", "#", "不", "#", "#"],
						["#", "", "不", "", "收", "#"],
						["#", "轮", "#", "数", "#", "#"],
						["#", "美", "#", "#", "#", "#"],
						["#", "", "#", "#", "#", "#"]
					],
					choose: ["数", "马", "美", "换", "焕", "到", "盛", "胜"],
					answer: [
						["#", "#", "#", "数", "#", "#"],
						["#", "#", "#", "不", "#", "#"],
						["#", "美", "不", "胜", "收", "#"],
						["#", "轮", "#", "数", "#", "#"],
						["#", "美", "#", "#", "#", "#"],
						["#", "焕", "#", "#", "#", "#"]
					],
				},
				{
					question: [
						["#", "#", "#", "#", "#", "#"],
						["#", "巧", "", "天", "工", "#"],
						["#", "#", "#", "长", "#", "#"],
						["#", "", "崩", "", "裂", "#"],
						["#", "#", "#", "", "#", "#"],
						["#", "#", "#", "#", "#", "#"]
					],
					choose: ["夺", "巧", "齐", "久", "花", "开", "山", "地"],
					answer: [
						["#", "#", "#", "#", "#", "#"],
						["#", "巧", "夺", "天", "工", "#"],
						["#", "#", "#", "长", "#", "#"],
						["#", "山", "崩", "地", "裂", "#"],
						["#", "#", "#", "久", "#", "#"],
						["#", "#", "#", "#", "#", "#"]
					],
				},
				{
					question: [
						["#", "#", "#", "#", "#", "#"],
						["#", "兴", "", "作", "浪", "#"],
						["#", "#", "吹", "#", "#", "#"],
						["#", "#", "", "长", "", ""],
						["#", "#", "动", "#", "#", "#"],
						["#", "#", "#", "#", "#", "#"]
					],
					choose: ["放", "风", "惊", "草", "飞", "到", "莺", "涛"],
					answer: [
						["#", "#", "#", "#", "#", "#"],
						["#", "兴", "风", "作", "浪", "#"],
						["#", "#", "吹", "#", "#", "#"],
						["#", "#", "草", "长", "莺", "飞"],
						["#", "#", "动", "#", "#", "#"],
						["#", "#", "#", "#", "#", "#"]
					],
				},
				{
					question: [
						["#", "#", "#", "#", "#", "#"],
						["#", "与", "", "俱", "", "#"],
						["#", "#", "积", "#", "#", "#"],
						["#", "明", "", "清", "", "#"],
						["#", "#", "累", "#", "#", "#"],
						["#", "#", "#", "#", "#", "#"]
					],
					choose: ["日", "星", "惜", "增", "花", "到", "月", "风"],
					answer: [
						["#", "#", "#", "#", "#", "#"],
						["#", "与", "日", "俱", "增", "#"],
						["#", "#", "积", "#", "#", "#"],
						["#", "明", "月", "清", "风", "#"],
						["#", "#", "累", "#", "#", "#"],
						["#", "#", "#", "#", "#", "#"]
					],
				},
				{
					question: [
						["#", "#", "#", "#", "劫", "#"],
						["#", "#", "", "#", "", "#"],
						["#", "", "舟", "", "济", "#"],
						["#", "#", "", "#", "", "#"],
						["#", "#", "剑", "#", "#", "#"],
						["#", "#", "#", "#", "#", "#"]
					],
					choose: ["刻", "穷", "富", "共", "同", "贫", "济", "求"],
					answer: [
						["#", "#", "#", "#", "劫", "#"],
						["#", "#", "刻", "#", "富", "#"],
						["#", "同", "舟", "共", "济", "#"],
						["#", "#", "求", "#", "贫", "#"],
						["#", "#", "剑", "#", "#", "#"],
						["#", "#", "#", "#", "#", "#"]
					],
				},
				{
					question: [
						["#", "#", "#", "#", "#", "#"],
						["#", "#", "", "滴", "", "穿"],
						["#", "#", "#", "", "#", "#"],
						["#", "#", "#", "成", "#", "#"],
						["#", "", "洁", "", "清", "#"],
						["#", "#", "#", "#", "#", "#"]
					],
					choose: ["水", "壶", "玉", "冰", "花", "晶", "石", "成"],
					answer: [
						["#", "#", "#", "#", "#", "#"],
						["#", "#", "水", "滴", "石", "穿"],
						["#", "#", "#", "水", "#", "#"],
						["#", "#", "#", "成", "#", "#"],
						["#", "玉", "洁", "冰", "清", "#"],
						["#", "#", "#", "#", "#", "#"]
					],
				}
			]
		}
		this.idArr = [];
		this.takeArr = ["", ""];
		this.count = 0;
		this.statu = false;
		this.pro = "";
		this.score=0;
		this.data=[{},{},{},{},{},{},{},{},{},{}];
		//存入了空白格的id
		for (var i = 0; i < this.content[this.state.num-1].question.length; i++) {
			for (var j = 0; j < this.content[this.state.num-1].question[i].length; j++) {
				if (this.content[this.state.num-1].question[i][j] === "") {
					var str = i + "" + j;
					this.idArr.push(str);
				}
			}
		}
	}
	show = (e) => {
		this.count = 0;
		for (var i = 0; i < this.refs.question.children.length; ++i) {
			if (this.refs.question.children[i].className.indexOf('active') >= 0) {
				this.refs.question.children[i].classList.remove('active');
			}
		}
		if (this.idArr.includes(e.target.id)) {
			e.target.classList.add('active');
		}

		if (e.target.id.indexOf("f") !== -1) {
			var value = e.target.innerHTML;
			this.takeArr[1] = value;

		}
		this.pro = this.takeArr[0];
		if (e.target.id.indexOf("f") === -1) {
			this.takeArr[0] = e.target.id;
		}

		var x = parseInt(this.takeArr[0].split("")[0]);
		var y = parseInt(this.takeArr[0].split("")[1]);
		if (this.takeArr[0] === "") {
			Toast.info("请选择要填入汉字的位置");
			this.takeArr[1] = ""
			return;
		}
		this.setState((state) => {
			if (this.idArr.includes(this.takeArr[0])) {
				state.content[this.state.num-1].question[x][y] = this.takeArr[1];
			}
			this.takeArr[1] = '';
			return {
				content: state.content
			}
		})
		console.log(this.state.content,this.content)
	}
	minus=(e)=>{
		this.setState((state)=>{
				if(--state.num<1){
						return{
								num:1
						}
				};
				return{
						num:state.num,
						next:"下一题",
						scsubmitFront:'jlsubmit-front'
				}
		})
}
	adds=(e)=>{
		this.setState((state)=>{
			if(state.num===10){
				this.submit()
			}
				if(++state.num>=10){
						return{
								num:10,
								next:"提交"
						}
				};
				return{
						num:state.num,
						next:"下一题",
						scsubmitFront:'jlsubmit-front1'
				}
		})    
}
	change = (e) => {
		e.target.className = (e.target.className === "iconfont icon-xingxing black") ? "iconfont icon-xingxing1 yello" : "iconfont icon-xingxing black"
	}
	submit=(e)=>{
		for(var i=0;i<this.state.content.length;i++){
			this.data[i].answer=this.state.content[i].answer;
			this.data[i].question=this.state.content[i].question;
			this.data[i].status=true;
			for(var m=0;m<this.data[i].answer.length;m++){
				for(var n=0;n<this.data[i].answer[m].length;n++){
					// console.log("m:"+m+" n:"+n+" ="+this.data[0].answer[m][n])
					if(this.data[i].answer[m][n]!==this.data[i].question[m][n]){
						this.data[i].status=false;
					}
				}
			}
		}
		this.data.map(item=>{
			if(item.status===true){
				this.score++;
			}
		})
		this.props.history.push({pathname:'/chengyu/jielong/grade',state:{data:this.data,score:this.score}});
	}
	componentDidUpdate(){
		this.idArr=[];
		for (var i = 0; i < this.content[this.state.num-1].question.length; i++) {
			for (var j = 0; j < this.content[this.state.num-1].question[i].length; j++) {
				if (this.content[this.state.num-1].question[i][j] === "") {
					var str = i + "" + j;
					this.idArr.push(str);
				}
			}
		}
	}
	render() {
		return (
			<div>
				<NavBar icon={<Icon type="left" onClick={()=>{this.props.history.push('/home/chengyu')}}/>} style={{ backgroundColor: "#617ca6" }}>成 语 接 龙</NavBar>

				<div className="idiomjlbody">

					<div className="idiomjlcon">
						<div>
							<div className='sm-box'>
							<div className='sm-textBox'>
								第 <span>{this.state.num}</span><span> / </span><span>10</span> 个
							</div>
                    	</div>
							{/* <div><img className="learnimg" src={require("../../../images/playbackground.jpeg")} /></div> */}
							<div className="jielongcon">
								<div className="jlcode">
									<div className="jlquestion" ref="question">
										{
											this.state.content[this.state.num-1].question.map((item, index) => (
												(item).map((item2, index2) => {
													if (item2 === "") {
														return <div id={index + "" + index2} onClick={this.show} className="wordcode">{item2}</div>
													}
													else if (item2 === "#") {
														return <div id={index + "" + index2} className="nocode">{item2}</div>
													}
													else {
														return <div id={index + "" + index2} onClick={this.show} className="wordcode">{item2}</div>
													}
												})
											))

										}
									</div>
								</div>
								<div className="answercode">
									{
										this.content[this.state.num-1].choose.map((item, index) => {
											return <div id={"f" + index} onClick={this.show} draggable="true" className="choosecode">{item}</div>
										})
									}
								</div>
							</div>
						</div>
					</div>
					<div className="jielongoutsubmit">
                        <Button onClick={this.minus} className={this.state.scsubmitFront}>{this.state.front}</Button>
                        <Button onClick={this.adds} className="jlsubmit-next">{this.state.next}</Button>
                    </div>
				</div>
			</div>
		)
	}
}
